{"keras_version": "1.2.2", "class_name": "Model", "config": {"layers": [{"config": {"batch_input_shape": [null, 299, 299, 3], "name": "input_1", "sparse": false, "input_dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 32, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_1", "mode": 0}, "name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 32, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_2", "mode": 0}, "name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_3", "mode": 0}, "name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_filter": 80, "nb_row": 1, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_4", "mode": 0}, "name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_5", "mode": 0}, "name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_9", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_9", "mode": 0}, "name": "batchnormalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_7", "init": "glorot_uniform", "nb_filter": 48, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_10", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_7", "mode": 0}, "name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_10", "mode": 0}, "name": "batchnormalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_1", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_6", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_8", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_11", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_12", "init": "glorot_uniform", "nb_filter": 32, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_12", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_6", "mode": 0}, "name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_8", "mode": 0}, "name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_11", "mode": 0}, "name": "batchnormalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_12", "mode": 0}, "name": "batchnormalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed0", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed0", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_16", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_16", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_16", "mode": 0}, "name": "batchnormalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_14", "init": "glorot_uniform", "nb_filter": 48, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_14", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_17", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_17", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_14", "mode": 0}, "name": "batchnormalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_17", "mode": 0}, "name": "batchnormalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_2", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_2", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_13", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_13", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_15", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_15", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_18", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_18", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_19", "init": "glorot_uniform", "nb_filter": 32, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_19", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_13", "mode": 0}, "name": "batchnormalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_15", "mode": 0}, "name": "batchnormalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_18", "mode": 0}, "name": "batchnormalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_19", "mode": 0}, "name": "batchnormalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed1", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed1", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_23", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_23", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_23", "mode": 0}, "name": "batchnormalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_21", "init": "glorot_uniform", "nb_filter": 48, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_21", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_24", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_24", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_21", "mode": 0}, "name": "batchnormalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_24", "mode": 0}, "name": "batchnormalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_3", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_3", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_20", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_20", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_22", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_22", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_25", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_25", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_24", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_26", "init": "glorot_uniform", "nb_filter": 32, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_26", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_3", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_20", "mode": 0}, "name": "batchnormalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_22", "mode": 0}, "name": "batchnormalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_25", "mode": 0}, "name": "batchnormalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_26", "mode": 0}, "name": "batchnormalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed2", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed2", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_28", "init": "glorot_uniform", "nb_filter": 64, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_28", "class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_28", "mode": 0}, "name": "batchnormalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_29", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_29", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_28", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_29", "mode": 0}, "name": "batchnormalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_27", "init": "glorot_uniform", "nb_filter": 384, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "name": "convolution2d_27", "class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_30", "init": "glorot_uniform", "nb_filter": 96, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "name": "convolution2d_30", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_27", "mode": 0}, "name": "batchnormalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_30", "mode": 0}, "name": "batchnormalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed3", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed3", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_35", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_35", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_35", "mode": 0}, "name": "batchnormalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_36", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_36", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_35", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_36", "mode": 0}, "name": "batchnormalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_32", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_32", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_37", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_37", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_36", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_32", "mode": 0}, "name": "batchnormalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_37", "mode": 0}, "name": "batchnormalization_37", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_33", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_33", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_32", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_38", "init": "glorot_uniform", "nb_filter": 128, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_38", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_37", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_33", "mode": 0}, "name": "batchnormalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_38", "mode": 0}, "name": "batchnormalization_38", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_4", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_4", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_31", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_31", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_34", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_34", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_39", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_39", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_38", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_40", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_40", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_4", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_31", "mode": 0}, "name": "batchnormalization_31", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_34", "mode": 0}, "name": "batchnormalization_34", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_39", "mode": 0}, "name": "batchnormalization_39", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_40", "mode": 0}, "name": "batchnormalization_40", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed4", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed4", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_45", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_45", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_45", "mode": 0}, "name": "batchnormalization_45", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_45", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_46", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_46", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_45", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_46", "mode": 0}, "name": "batchnormalization_46", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_46", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_42", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_42", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_47", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_47", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_46", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_42", "mode": 0}, "name": "batchnormalization_42", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_42", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_47", "mode": 0}, "name": "batchnormalization_47", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_47", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_43", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_43", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_42", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_48", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_48", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_47", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_43", "mode": 0}, "name": "batchnormalization_43", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_43", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_48", "mode": 0}, "name": "batchnormalization_48", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_48", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_5", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_5", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed4", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_41", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_41", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_44", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_44", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_43", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_49", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_49", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_48", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_50", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_50", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_5", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_41", "mode": 0}, "name": "batchnormalization_41", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_41", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_44", "mode": 0}, "name": "batchnormalization_44", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_44", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_49", "mode": 0}, "name": "batchnormalization_49", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_49", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_50", "mode": 0}, "name": "batchnormalization_50", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_50", 0, 0]]]}, {"config": {"concat_axis": 3, "output_mask_type": "raw", "mode": "concat", "mode_type": "raw", "arguments": {}, "name": "mixed5", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "dot_axes": -1}, "name": "mixed5", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_55", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_55", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_55", "mode": 0}, "name": "batchnormalization_55", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_55", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_56", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_56", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_55", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_56", "mode": 0}, "name": "batchnormalization_56", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_56", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_52", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_52", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_57", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_57", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_56", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_52", "mode": 0}, "name": "batchnormalization_52", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_52", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_57", "mode": 0}, "name": "batchnormalization_57", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_57", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_53", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_53", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_52", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_58", "init": "glorot_uniform", "nb_filter": 160, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_58", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_57", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_53", "mode": 0}, "name": "batchnormalization_53", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_53", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_58", "mode": 0}, "name": "batchnormalization_58", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_58", 0, 0]]]}, {"config": {"strides": [1, 1], "border_mode": "same", "name": "averagepooling2d_6", "pool_size": [3, 3], "trainable": true, "dim_ordering": "tf"}, "name": "averagepooling2d_6", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed5", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_51", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_51", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_54", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 7, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_54", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_53", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_59", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_59", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_58", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "nb_col": 1, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_60", "init": "glorot_uniform", "nb_filter": 192, "nb_row": 1, "border_mode": "same", "W_regularizer": null, "activation": "relu", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "name": "convolution2d_60", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_6", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_51", "mode": 0}, "name": "batchnormalization_51", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_51", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_54", "mode": 0}, "name": "batchnormalization_54", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_54", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "name": "batchnormalization_59", "mode": 0}, "name": "batchnormalization_59", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_59", 0, 0]]]}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, 