{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 16, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 3, 256, 256], "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_5"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_6"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_8", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_8"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_9", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_11"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_12", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_12"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_13", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_13"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_14", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_14"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 2048}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_15", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "PReLU", "config": {"init": "he_normal", "trainable": true, "name": "prelu_15"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.003000000026077032, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 8}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_16", "epsilon": 1e-05, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}